## Terraform Plan - `k8s-cluster` - Development 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourcegroups/feyrek8s-dev-rg/providers/Microsoft.ContainerService/managedClusters/feyrek8s-dev-aks]
azurerm_role_assignment.acrpull_role: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev/providers/Microsoft.Authorization/roleAssignments/12a4320d-cf1d-f021-d906-dd99bd6ff7f9]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s-cluster`, Workflow: `deployment`

## Terraform Plan - `k8s` - Development 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backend.kubectl_manifest.backend_deployment[0] will be created
  + resource "kubectl_manifest" "backend_deployment" {
      + api_version             = "apps/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend"
      + namespace               = "backend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: backend
              name: backend
              namespace: backend
            spec:
              replicas: 2
              selector:
                matchLabels:
                  name: backend
              template:
                metadata:
                  labels:
                    name: backend
                spec:
                  containers:
                  - args:
                    - app.py
                    command:
                    - python3
                    image: feyrek8sacrdev.azurecr.io/backend:dev
                    imagePullPolicy: Always
                    name: backend
                    ports:
                    - containerPort: 80
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.backend.kubectl_manifest.backend_namespace[0] will be created
  + resource "kubectl_manifest" "backend_namespace" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: backend
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.backend.kubectl_manifest.backend_service[0] will be created
  + resource "kubectl_manifest" "backend_service" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend"
      + namespace               = "backend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                name: backend
              name: backend
              namespace: backend
            spec:
              ports:
              - port: 80
                targetPort: 80
              selector:
                name: backend
              type: ClusterIP
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_deployment[0] will be created
  + resource "kubectl_manifest" "frontend_deployment" {
      + api_version             = "apps/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "frontend"
      + namespace               = "frontend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: frontend
              name: frontend
              namespace: frontend
            spec:
              replicas: 1
              selector:
                matchLabels:
                  name: frontend
              template:
                metadata:
                  labels:
                    name: frontend
                spec:
                  containers:
                  - args:
                    - app.js
                    command:
                    - node
                    env:
                    - name: DISCORD_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: DISCORD_TOKEN
                          name: frontend-secret
                    - name: ENVIRONMENT
                      value: dev
                    image: feyrek8sacrdev.azurecr.io/frontend:dev
                    imagePullPolicy: Always
                    name: frontend
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_namespace[0] will be created
  + resource "kubectl_manifest" "frontend_namespace" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "frontend"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: frontend
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_secret[0] will be created
  + resource "kubectl_manifest" "frontend_secret" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "frontend-secret"
      + namespace               = "frontend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: frontend-secret
              namespace: frontend
            type: Opaque
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s`, Workflow: `deployment`